<pre>################### multisort() ####################
unsorted arrays:
array(2) {
  [0]=>
  &array(5) {
    [0]=>
    object(ExampleData)#3 (1) {
      ["value":"ExampleData":private]=>
      int(1)
    }
    [1]=>
    object(ExampleData)#4 (1) {
      ["value":"ExampleData":private]=>
      int(0)
    }
    [2]=>
    object(ExampleData)#5 (1) {
      ["value":"ExampleData":private]=>
      int(2)
    }
    [3]=>
    object(ExampleData)#6 (1) {
      ["value":"ExampleData":private]=>
      int(-1)
    }
    [4]=>
    object(ExampleData)#7 (1) {
      ["value":"ExampleData":private]=>
      int(0)
    }
  }
  [1]=>
  &array(5) {
    [0]=>
    string(3) "one"
    [1]=>
    string(4) "zero"
    [2]=>
    string(3) "two"
    [3]=>
    string(9) "minus one"
    [4]=>
    string(7) "zero(2)"
  }
}
after multisort():
array(2) {
  [0]=>
  &array(5) {
    [0]=>
    object(ExampleData)#6 (1) {
      ["value":"ExampleData":private]=>
      int(-1)
    }
    [1]=>
    object(ExampleData)#4 (1) {
      ["value":"ExampleData":private]=>
      int(0)
    }
    [2]=>
    object(ExampleData)#7 (1) {
      ["value":"ExampleData":private]=>
      int(0)
    }
    [3]=>
    object(ExampleData)#3 (1) {
      ["value":"ExampleData":private]=>
      int(1)
    }
    [4]=>
    object(ExampleData)#5 (1) {
      ["value":"ExampleData":private]=>
      int(2)
    }
  }
  [1]=>
  &array(5) {
    [0]=>
    string(9) "minus one"
    [1]=>
    string(4) "zero"
    [2]=>
    string(7) "zero(2)"
    [3]=>
    string(3) "one"
    [4]=>
    string(3) "two"
  }
}
################### unique() ####################
array with multiple equivalent values:
array(5) {
  [0]=>
  object(ExampleData)#6 (1) {
    ["value":"ExampleData":private]=>
    int(-1)
  }
  [1]=>
  object(ExampleData)#4 (1) {
    ["value":"ExampleData":private]=>
    int(0)
  }
  [2]=>
  object(ExampleData)#7 (1) {
    ["value":"ExampleData":private]=>
    int(0)
  }
  [3]=>
  object(ExampleData)#3 (1) {
    ["value":"ExampleData":private]=>
    int(1)
  }
  [4]=>
  object(ExampleData)#5 (1) {
    ["value":"ExampleData":private]=>
    int(2)
  }
}
after unique():
array(4) {
  [0]=>
  object(ExampleData)#6 (1) {
    ["value":"ExampleData":private]=>
    int(-1)
  }
  [1]=>
  object(ExampleData)#7 (1) {
    ["value":"ExampleData":private]=>
    int(0)
  }
  [3]=>
  object(ExampleData)#3 (1) {
    ["value":"ExampleData":private]=>
    int(1)
  }
  [4]=>
  object(ExampleData)#5 (1) {
    ["value":"ExampleData":private]=>
    int(2)
  }
}
################### ObjectComparator ####################
array with multiple equal values:
array(4) {
  [0]=>
  object(stdClass)#9 (0) {
  }
  [1]=>
  object(stdClass)#4 (0) {
  }
  [2]=>
  object(stdClass)#11 (0) {
  }
  [3]=>
  object(stdClass)#9 (0) {
  }
}
after unique() with ObjectComparator:
array(3) {
  [0]=>
  object(stdClass)#4 (0) {
  }
  [1]=>
  object(stdClass)#9 (0) {
  }
  [3]=>
  object(stdClass)#11 (0) {
  }
}
################### SplFileInfoComparator ####################
ObjectSortingIterator with SplFileInfoComparatorMTime:
08.09. 15:55 - ExampleData.php
08.09. 15:56 - ExampleComparator.php
08.09. 16:09 - randomdata.inc
08.09. 16:11 - sort.php
08.09. 16:12 - sort_procedural.php
01.12. 10:13 - output.sort.php.html
01.12. 19:38 - advanced.php
01.12. 19:38 - output.advanced.php.html
</pre>